#+STARTUP: overview

* General emacs configuration
   #+begin_src emacs-lisp
   ;(setq ido-enable-flex-matching t)
   ;(setq ido-everywhere t)
   ;(ido-mode 1)

   (electric-pair-mode 1)
   (show-paren-mode 1)
   (highlight-indentation-mode 1)

   (tool-bar-mode -1)
   (scroll-bar-mode -1)

   (setq display-line-numbers 'relative)
   (global-display-line-numbers-mode t)

   (setq org-agenda-files (list "~/.org/work.org"
                                "~/.org/home.org"))

   (setq backup-directory-alist '(("." . "~/.emacs.d/saves")))
   (setq backup-by-copying t ; Don't delink hardlinks
      delete-old-versions t  ; Clean up the backups
      version-control t      ; Use version numbers on backups,
      kept-new-versions 5    ; keep some new versions
      kept-old-versions 2)   ; and some old ones, too
   #+end_src

   #+RESULTS:
   | ~/.org/work.org | ~/.org/home.org |
